package type;

public class Var {
	public static void main(String[] args) {
		//변수의 기본 타입(형)_컴퓨터가 자동으로 만들어 놓은 타입. 보라색 필요한 것은 만들어서 사용가능하다.
		boolean A; //*블리언 : true, false만 들어갈 수 있는 규격. 철학자 bool 세상은 이분법이다. 
		char B;    // 케릭터 : 문자 하나가 들어갈 수 있는 규격.
		byte C;    // 바이트 : 아주 작은 숫자가 들어갈 수 있는 규격
		short D;   // 숏 : 중간정도의 수가 들어갈 수 있는 규격
		int E;     //*인티저 : 일상적인 수가 들어갈 수 있는 규격
		long F;	   // 롱 : 아주 긴 수가 들어갈 수 있는 규격	
		float G;   // 플로트 : 짧은 소수점이 들어갈 수 있는 규격 . 소숫점아래 7자리까지 저장가능
		double H;  //*더블 : 플로트의 2배. 긴 소수점이 들어갈 수 있는 규격
		
		//커스텀 변수 타입
		String I; //스트링 : 문자열(문장)을 저장할 수 있는 규격 그래서 검정색이다.
		
	}
}

